Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_8_Constructional requirements _8 KONSTRUKTSIOONINÕUDED .tmx
Source language: en
Languages: et

source: – The minimum cross-sectional area shall be 10 mm2 for copper or 16 mm2 for aluminium.
et: — vaskjuhtide ristlõige peab olema vähemalt 10 mm2, alumiiniumjuhtide ristlõige aga vähemalt 16 mm2;

source: – The PEN and PEM conductor shall have a cross-sectional area not less than that required for a neutral and mid-point conductor (see 8.6.1).
et: — PEN- ega PEM-juhi ristlõige ei tohi olla väiksem kui neutraal- või keskjuhi nõutav ristlõige (vt jaotis 8.6.1);

source: – The PEN, PEL and PEM conductors need not be insulated within a class I assembly.
et: — PEN-, PEL- ega PEM-juhte pole vaja I klassi kuuluva kooste sisemuses isoleerida;

source: – Structural parts shall not be used as a PEN, PEL and PEM conductor; however, mounting rails according to IEC 60947-7-2:2009, Annex A, made of copper or aluminium may be used.
et: — PEN-, PEL- ega PEM-juhina ei tohi kasutada tariosi, kuid võib kasutada standardi IEC 60947-7-2:2009 lisale A vastavaid vasest või alumiiniumist paigaldusliiste.

source: For details of requirements for terminals for external protective conductors, see 8.8.
et: Üksikasjalikud nõuded väliste kaitsejuhtide klemmide kohta on esitatud jaotises 8.8.

source: 8.4.3.3 Electrical separation Electrical separation of individual circuits is intended to prevent electrical shock through contact with exposed-conductive-parts, which can become live when basic insulation of the circuit fails.
et: 8.4.3.3 Elektriline eraldamine Üksikahelate elektriline eraldamine on ette nähtud selleks, et vältida elektrilööki kokkupuutel pingealdiste juhtivate osadega, mis võivad pingestuda ahela põhiisolatsiooni rikke korral.

source: For this type of protection, see IEC 60364-4-41:2005 and IEC 60364-4-41:2005/AMD1:2017.
et: Seda liiki kaitse kohta vt standardid IEC 60364-4-41:2005 ja IEC 60364-4-41:2005/AMD1:2017.

source: 8.4.4 Additional requirements for class II assemblies
et: 8.4.4 Lisanõuded II klassi kuuluvatele koostetele

source: a) For basic and fault protection, by double or reinforced insulation, the following additional requirements shall be met.
et: a) Põhi- ja rikkekaitse kohta tuleb topelt- või tugevdatud isolatsiooni korral kasutada alljärgnevaid lisanõudeid.

source: The electrical equipment shall be enclosed in insulating material which is equivalent of double or reinforced insulation.
et: Elektriseadmed tuleb ümbritseda isoleermaterjalist ümbrisega, mis on võrdväärne topelt- või tugevdatud isolatsiooniga.

source: The enclosure shall carry the symbol which shall be visible from the outside of the protected space.
et: Ümbrisel peab olema väljastpoolt kaitstavat ruumi nähtav sümbol .

source: The enclosure can be the protected space or the protected space can be behind a barrier behind the door of an enclosure.
et: Ümbris võib kas ümbritseda kaitstavat ruumi või võib kaitstav ruum olla ümbrise ukse taga oleva katte taga.

source: The requirement of a class II assembly can be fulfilled by means of a metal enclosure separated from hazardous live parts and protective PEL, PEM and PEN conductors by double or reinforced insulation.
et: II klassi kuuluva kooste nõude võib täita metallümbrisega, mis on eraldatud ohtlikest pingestatud osadest ja PEL-, PEM- või PEN-kaitsejuhtidest topelt- või tugevdatud isolatsiooniga.

source: b) The enclosure shall at no point be pierced by conducting parts in such a manner that there is the possibility of a fault voltage being brought out of the enclosure.
et: b) Ümbrist ei tohi üheski kohas läbida juhtivad osad, mis võiksid põhjustada rikkepinge kandumist väljapoole ümbrist.

source: This means that metal parts, such as actuator shafts that, for constructional reasons, have to be brought through the enclosure, shall be insulated on the inside or the outside of the enclosure from the live parts for the maximum rated insulation voltage and the maximum rated impulse withstand voltage of all circuits in the assembly.
et: See tähendab, et metallosad, nagu täiturite võllid, mis konstruktsioonilistel põhjustel lähevad läbi ümbrise, peavad olema isoleeritud pingestatud osadest ümbrise sisemuses või väljaspool ümbrist vastavalt kooste kõigi ahelate isolatsiooni suurimale tunnuspingele ja suurimale tunnusimpulsstaluvuspingele.

source: If an actuator, or similar, is made of metal (whether covered by insulating material or not), it shall be provided with insulation rated for the maximum rated insulation voltage and the maximum impulse withstand voltage of all circuits in the assembly.
et: Kui täitur või muu taoline on valmistatud metallist (kas isoleermaterjaliga kaetult või katmata), tuleb see varustada isolatsiooniga, mis vastab kooste kõigi ahelate isolatsiooni suurimale tunnuspingele ja suurimale tunnus-impulsstaluvuspingele.

source: c) If an actuator, or similar, is principally made of insulating material, any of its metal parts which may become accessible in the event of insulation failure shall also be insulated from live parts for the maximum rated insulation voltage and the maximum rated impulse withstand voltage of all circuits in the assembly.
et: c) Kui täitur või muu taoline on põhiliselt isoleermaterjalist, peab iga selle metallosa, mis võib isolatsiooni tõrke korral tulla juurdepääsetavaks, olema pingestatud osadest samuti isoleeritud vastavalt kooste kõigi ahelate isolatsiooni suurimale tunnuspingele ja suurimale tunnus-impulsstaluvuspingele.

source: The enclosure or protected space, when the class II assembly is ready for operation and connected to the supply, shall enclose all live parts, exposed-conductive-parts and parts belonging to a protective circuit in such a manner that they cannot be touched.
et: Kui II klassi kuuluv kooste on talitlusvalmis ja toiteallikaga ühendatud, peab kooste ümbris või kaitstud ruum ümbritsema kõiki pingestatud, pingealteid juhtivaid ja kaitsejuhiahelasse kuuluvaid osi selliselt, et neid ei saaks puudutada.

source: The enclosure shall give at least the degree of protection IP2XC (see IEC 60529:1989, IEC 60529:1989/AMD1:1999 and IEC 60529:1989/AMD2:2013).
et: Ümbris peab tagama vähemalt kaitseastme IP2XC (vt standardid IEC 60529:1989, IEC 60529:1989/AMD1:1999 ja IEC 60529:1989/AMD2:2013).

source: If an external protective PEL, PEM or PEN conductor is passed through the class II assembly, the assembly should be provided with a suitably identified terminal.
et: Kui väline PEL-, PEM- või PEN-kaitsejuht läbib II klassi kuuluvat koostet, tuleb kooste varustada sobivalt tuvastatava klemmiga.

source: d) Inside the enclosure or protected space of a class II assembly, the protective conductor, (PE, PEL, PEM or PEN conductor) and its terminal shall be insulated from the live parts and the exposed-conductive-parts.
et: d) II klassi kuuluva kooste ümbrise või kaitstava ruumi sees peab kaitsejuht (PE-, PEL-, PEM- või PEN-juht) ja selle klemm olema pingestatud ja pingealdistest juhtivatest osadest isoleeritud.

source: Exposed-conductive-parts within the assembly shall not be connected to the protective conductor.
et: Koostesiseseid pingealteid juhtivaid osi ei tohi ühendada kaitsejuhiga.

source: This applies also to built-in apparatus, even if they have a connecting terminal for a protective conductor.
et: See kehtib ka koostesse sisse ehitatud aparaatide kohta, isegi kui neil on kaitsejuhi ühendamiseks mõeldud ühendusklemm.

source: e) If doors or covers of the enclosure can be opened without the use of a key or tool, a barrier of insulating material shall be provided that will afford protection of at least IPXXB against unintentional contact not only with the accessible live parts, but also with the exposedconductive-parts that are only accessible after the door or cover has been opened; this barrier, however, shall not be removable except with the use of a tool.
et: e) Kui ümbrise uksi ja katteid saab avada võtit või tööriista kasutamata, tuleb ette näha isoleermaterjalist kaitsekate, et võimaldada kaitseastet vähemalt IPXXB tahtmatu kokkupuute eest mitte üksnes juurdepääsetavate pingestatud osadega, vaid ka pingealdiste juhtivate osadega, mis on ligipääsetavad üksnes pärast ukse või katte avamist; seda kaitsekatet ei tohi aga olla võimalik eemaldada, väljaarvatult tööriista kasutamise teel.

source: 8.4.5 Limitation of steady-state touch currents and charge If the assembly contains items of equipment that may retain charges after they have been switched off (capacitors banks without internal basic protection, etc.), a warning label is required.
et: 8.4.5 Püsi-puutevoolu ja -puutelaengu piiramine Kui kooste sisaldab seadmeid, millel võivad pärast väljalülitamist säilida laengud (ilma sisemise põhikaitseta kondensaatorpatareid jne), tuleb koostele kinnitada hoiatussilt.

source: Small capacitors such as those used for arc extinction, for delaying the response of relays, etc., shall not be considered dangerous.
et: Väikekondensaatoreid, mida kasutatakse näiteks kaarekustutuseks või releede viivitusahelates jne, ei peeta ohtlikuks.

source: Unintentional contact is not considered dangerous if the voltages resulting from static charges fall below a DC voltage of 60 V in less than 5 s after disconnection from the power supply.
et: Tahtmatut puudet ei peeta ohtlikuks, kui staatilistest laengutest tingitud alalispinge langeb alla 60 V vähem kui 5 s jooksul pärast elektritoite väljalülitamist.

source: Touch currents are limited by ensuring exposed-conductive-parts are effectively connected to the protective conductor.
et: Puutevoolusid saab piirata, kui tagada, et pingealtid juhtivad osad on tõhusalt ühendatud kaitsejuhiga.

source: See 10.5.2.
et: Vt ka jaotis 10.5.2.

source: 8.4.6 Operating and servicing conditions
et: 8.4.6 Talitlus- ja teenindusolud

source: 8.4.6.1 Devices to be operated or components to be replaced by ordinary persons
et: 8.4.6.1 Tavaisikute käitatavad seadised ja vahetatavad komponendid

source: Protection against any contact with live parts shall be maintained when operating devices or when replacing components.
et: Pingestatud osade täielik puutekaitse peab säilima seadiste käitamisel ja komponentide vahetamisel.

source: The minimum degree of protection shall be IPXXC.
et: Kaitseaste peab olema vähemalt IPXXC.

source: During the replacement of certain lamps or fuselinks, openings larger than those defined by the degree of protection IPXXC are allowed.
et: Mõningate lampide või sularite vahetamise ajal lubatakse avausi, mis on suuremad, kui kaitseastmega IPXXC sätestatud.

source: 8.4.6.2 Requirements related to accessibility in service by authorized persons
et: 8.4.6.2 Nõuded volitatud isikute juurdepääsetavusele talitlusel

source: 8.4.6.2.1 General
et: 8.4.6.2.1 Üldnõuded

source: Depending on the application and accessibility necessary in service, by authorized person(s), one or more of the following requirements in 8.4.6.2.2 to 8.4.6.2.4 shall be fulfilled.
et: Olenevalt rakendusest ja volitatud isiku(te) vajalikuks juurdepääsetavuseks talitlusel tuleb täita üht või enamat alljärgnevatest jaotistes 8.4.6.2.2 kuni 8.4.6.2.4 esitatud nõuetest.

source: These requirements shall be complementary to the basic protection specified in 8.4.2.
et: Need nõuded peavad täiendama jaotises 8.4.2 sätestatud põhikaitset.

source: If doors or covers of the assembly can be opened by authorized persons by overriding an interlock to obtain access to live parts, then the interlock shall automatically be restored on reclosing the door(s) or replacing the cover(s).
et: Kui kooste uksi või katteid saavad volitatud isikud blokeeringu mahavõtmise teel juurdepääsuks pingestatud osadele avada, peab blokeering automaatselt taastuma ukse (või uste) taas sulgumise või katte (või katete) taas-kohaleasetumise teel.

source: Obstacles can be used to prevent either:
et: Tõkkeid võib kasutada, et vältida kas

source: – unintentional bodily approach to live parts; or
et: — tahtmatut kehalist lähenemist pingestatud osadele või

source: – unintentional contact with live parts during the operation of live equipment in normal service.
et: — tahtmatut kokkupuudet pingestatud osadega pingestatud seadmete normaaltalitlusel.

source: Obstacles may be removed without using a key or tool but shall be so secured as to prevent unintentional removal.
et: Tõkkeid võib kõrvaldada võtme või tööriista kasutamiseta, kuid need peavad olema sedavõrd turvaliselt kinnitatud, et tahtmatu kõrvaldamine oleks välditud.

source: The distance between a conductive obstacle and the live parts they protect shall not be less than the values specified for the clearances and creepage distances in 8.3.
et: Kaugus juhtiva tõkke ja pingestatud osade vahel, mida see kaitseb, ei tohi olla väiksem kui jaotises 8.3 õhk- ja roomevahemike jaoks sätestatud.

source: Where a conductive obstacle is separated from hazardous live parts by basic protection only, it is an exposed-conductive-part, and measures for fault protection shall also be applied.
et: Kui juhtiv tõke on eraldatud ohtlikest pingestatud osadest üksnes põhikaitsega, on see pingealdis juhtiv osa ja tuleb ühtlasi rakendada rikkekaitseviise.

source: 8.4.6.2.2 Requirements related to accessibility for inspection and similar operations
et: 8.4.6.2.2 Nõuded juurdepääsetavusele seoses ülevaatuse ja muude taoliste toimingutega

source: The assembly shall be constructed in such a way that certain operations can be performed when the assembly is in service and energized.
et: Kooste peab olema konstrueeritud selliselt, et mõningaid toiminguid saab sooritada ka siis, kui kooste on talitluses ning pingestatud.

source: Such operations may consist of:
et: Sellised toimingud võivad sisaldada

source: – visual inspections of;
et: — visuaalset ülevaatust

source: • switching devices and other apparatus;
et: • lülitus- ja muude aparaatide kohta,

source: • settings and indicators of relays and releases;
et: • releede ja vabastite sätete ja näidikute kohta,

source: • conductor connections and marking;
et: • juhtide ühenduste ning märgistuse kohta;

source: – adjusting and resetting of relays, releases and electronic devices;
et: — releede, vabastite ja elektroonikaseadiste häälestamist ja ennistamist;

source: – replacement of fuse-links;
et: — sularite vahetamist;

source: – replacement of indicating lamps;
et: — indikaatorlampide vahetamist;

source: – certain fault location operations, for example voltage and current measuring with suitably designed and insulated devices.
et: — mõningaid rikketuvastusoperatsioone, näiteks pinge ja voolu mõõtmist sobivalt kujundatud ja isoleeritud seadistega.

source: 8.4.6.2.3 Requirements related to accessibility for maintenance
et: 8.4.6.2.3 Nõuded juurdepääsetavusele hoolduse puhul

source: To enable maintenance on an isolated functional unit or isolated group of functional units in the assembly, with adjacent functional units or groups still energized, necessary measures shall be taken.
et: Et võimaldada kooste turvalahutatud funktsionaalühiku või turvalahutatud funktsionaalühikute rühma hooldust, kui naaber-funktsionaalühikud või nende rühmad on jäetud pingestatuks, tuleb rakendada vajalikke meetmeid.

source: The choice depends on such factors as service conditions, frequency of maintenance, competence of the authorized person, as well as local installation rules.
et: Meetmete valik sõltub sellistest teguritest nagu teenindusolud, hooldustööde sagedus, volitatud isikute pädevus ja ka kohalikud paigaldusreeglid.

source: Such measures may include the following:
et: Sellised meetmed võivad sisaldada

source: – sufficient space between the actual functional unit or group and adjacent functional units or groups.
et: — piisavat vahekaugust käidetava funktsionaalühiku või funktsionaalühikute rühma ja naaberfunktsionaalühikute või nende rühmade vahel.

source: It is recommended that parts likely to be removed for maintenance have, as far as possible, retainable fastening means;
et: Soovitatakse, et osad, mida hooldamiseks tõenäoliselt tuleb eemaldada, oleksid varustatud, niipalju kui võimalik, mitteeralduvate kinnitusvahenditega;

source: – use of barriers or obstacles designed and arranged to protect against direct contact with equipment in adjacent functional units or groups;
et: — kaitsekatete või -tõkete kasutamist, mis on kujundatud ja paigutatud kaitseks otsepuute eest naaberfunktsionaalühikutes või nende rühmades paiknevate seadmetega;

source: – use of terminal shields;
et: — klemmikatete kasutamist;

source: – use of compartments for each functional unit or group;
et: — lahtrite kasutamist iga funktsionaalühiku või nende rühma jaoks;

source: – insertion of additional protective means provided or specified by the assembly manufacturer.
et: — kooste tootja ettenähtud või sätestatud lisa-kaitseviiside rakendamist.

source: 8.4.6.2.4 Requirements related to accessibility for extension when energized
et: 8.4.6.2.4 Nõuded seoses juurdepääsetavusega pingestatud kooste laiendamisel

source: When it is required to enable future extension of an assembly with additional functional units or groups, with the rest of the assembly still energized, the requirements specified in 8.4.6.2.3 shall apply, subject to agreement between the assembly manufacturer and the user.
et: Kui nõutakse kooste edasise laiendamise võimaldamist lisa-funktsionaalühikute või nende rühmadega oludes, mil kooste ülejäänud osa on jäetud pinge alla, tuleb rakendada jaotise 8.4.6.2.3 nõudeid vastavalt kooste tootja ja kasutaja kokkuleppele.

source: These requirements also apply for the insertion and connection of additional outgoing cables when the existing cables are energized.
et: Neid nõudeid rakendatakse ka lisa-väljundkaablite paigaldamisel ja külgeühendamisel, kui olemasolevad kaablid on pingestatud.

source: The extension of busbars and connection of additional units to their incoming supply shall not be made when energized, unless the assembly is designed for this purpose.
et: Kogumislattide pikendamist ja lisaühikute ühendamist nende sisend-toiteliiniga ei tohi sooritada pingestatud olukorras, välja arvatud juhul, mil kooste on selleks otstarbeks ette nähtud.

source: 8.5 Incorporation of switching devices and components
et: 8.5 Lülitusseadiste ja komponentide ühendamine

source: 8.5.1 Fixed parts
et: 8.5.1 Kohtkindlad osad

source: For fixed parts (see 3.2.1), the connections of the main circuits (see 3.1.3) shall only be connected or disconnected when the assembly is not energized.
et: Kohtkindlate osade (vt termin 3.2.1) puhul võib peaahelate (vt termin 3.1.3) ühendusi kokku või lahti ühendada üksnes siis, kui kooste ei ole pingestatud.

source: Removal and installation of fixed parts requires the use of a tool.
et: Kohtkindlate osade eemaldamine ja paigaldamine nõuab tööriista kasutamist.

source: The disconnection of a fixed part shall require the isolation of the complete assembly or part of it.
et: Kohtkindla osa lahtiühendamiseks tuleb nõuda kogu kooste või selle osa turvalahutamist.

source: In order to prevent unauthorized operation, the switching device may be provided with means to secure it in one or more of its positions.
et: Volitamata toimingute vältimiseks võib lülitusseadise varustada vahenditega selle kindlaks fikseerimiseks ühes või mitmes asendis.

source: 8.5.2 Removable parts
et: 8.5.2 Eemaldatavad osad

source: The removable parts shall be so constructed that their electrical equipment can be safely removed from, or connected to, the main circuit even if this circuit is live.
et: Eemaldatavad osad peavad olema sellise ehitusega, et nende elektriseadmeid saaks peaahelast ohutult eemaldada või sellega kokku ühendada ka siis, kui peaahel on pingestatud.

source: The removable parts may be provided with an insertion interlock (see 3.2.5).
et: Eemaldatavad osad võivad olla varustatud sisestusblokeeringuga (vt termin 3.2.5).

source: Clearances and creepage distances (see 8.3) shall be complied with during transfer from one position to another.
et: Teisaldamise ajal ühest asendist teise tuleb järgida õhk- ja roomevahemikke (vt jaotis 8.3).

source: A removable part shall be fitted with a device that ensures that it can only be removed and inserted after its main circuit has been switched off from the load.
et: Eemaldatav osa peab olema varustatud seadisega, mis võimaldab seda osa eemaldada ja tagasi asetada vaid pärast seda, kui selle peaahel on koormusest lahutatud.

source: If unauthorized operation, can occur, then the removable parts shall be provided with a locking means to secure them in one or more of their positions.
et: Juhtuda võivate volitamata operatsioonide vältimiseks tuleb eemaldatavad osad varustada lukustusvahenditega, et neid saaks kindlalt kinnitada nende ühte või mitmesse asendisse.

source: 8.5.3 Selection of switching devices and components Switching devices and components incorporated in assemblies shall comply with the relevant IEC standards.
et: 8.5.3 Lülitusseadiste ja komponentide valik Koostetes sisalduvad lülitusseadised ja komponendid peavad vastama asjakohaste IEC standarditele.

source: The switching devices and components shall be suitable for the particular application with respect to the external design of the assembly (e.g. open type or enclosed), their rated voltages, rated currents, rated frequency, service life, making and breaking capacities, short-circuit withstand strength, etc.
et: Lülitusseadised ja komponendid peavad sobima ettenähtud kasutamiseks sõltuvalt kooste väliskujundusest (nt lahtine või kinnine kooste), nende tunnuspingetest, tunnusvooludest, tunnussagedusest, talitluskestusest, sisse- ja väljalülitusvõimest, lühisetaluvusest jne.

source: The rated insulation voltage, and rated impulse withstand voltage of the devices installed in the circuit shall be equal or higher than the corresponding value assigned to that circuit.
et: Ahelasse paigaldatud seadiste isolatsiooni tunnuspinge ja tunnus-impulsstaluvuspinge peavad olema vähemalt sama kõrged kui ahelale ette nähtud vastavad väärtused.

source: In some cases, overvoltage protection may be necessary (e.g. for equipment fulfilling overvoltage category II (see 3.6.11)).
et: Mõnel juhul võib vaja olla liigpingekaitset (nt seadiste puhul, mis vastavad II liigpingekategooriale (vt termin 3.6.11).

source: The switching devices and components having a short-circuit withstand strength and/or a breaking capacity which is insufficient to withstand the stresses likely to occur at the place of installation, shall be protected by means of protective devices with suitable current-limiting characteristics, for example fuses or current-limiting circuit-breakers.
et: Lülitusseadiseid ja -komponente, mille lühisetaluvus ja/või lahutusvõime pole piisavad paigalduskohal tõenäoliselt võimalike toimete talumiseks, tuleb kaitsta voolupiiravate kaitseseadistega, näiteks sulavkaitsmete või voolupiiravate kaitselülititega.

source: When selecting current-limiting protective devices for built-in switching devices, the maximum permissible values specified by the device manufacturer shall be taken into account with due regard to coordination (see 9.3.4).
et: Voolupiiravate kaitseseadiste valikul sisseehitatud lülitusseadiste jaoks tuleb arvestada seadise tootja sätestatud suurimaid lubatavaid väärtusi sõltuvalt nende nõutavast koordinatsioonist (vt jaotis 9.3.4).

source: Coordination of switching devices and components shall comply with the relevant IEC standards.
et: Lülitusseadiste ja komponentide koordineerimine peab järgima asjakohaseid IEC standardeid.

source: Coordination of motor starters with short-circuit protective devices shall comply with IEC 609474-1:2018.
et: Mootorikäivitite koordineerimine lühisekaitseaparaatidega peab vastama standardile IEC 60947-4-1:2018.

source: See also 9.3.4.
et: Vt ka jaotis 9.3.4.
